export const GAME_SETTINGS = {
  //
  //
  //    |||     ||||||             |||    ||||||
  //    |||     ||  ||    \\ //    |||    ||___
  //    |||     ||  ||     \\\     |||        ||
  //    |||     ||||||    // \\    |||    ||||||
  //
  //     ||||||||||||
  //    ||          ||
  //    ||   X   X  ||
  //    ||          ||
  //    ||   ____   ||
  //    ||          ||
  //     ||||||||||||
  //
  rows: 15,
  columns: 10,
  score: 0,
  lines: 0,
  initPlayField: () =>
    Array.from({ length: GAME_SETTINGS.rows }, (сolumns) =>
      Array.from({ length: GAME_SETTINGS.columns }, (cell) => 0),
    ),
};

export const TETROMINO_TYPES = ['o', 'i', 's', 'z', 'l', 'j', 't'];

export const TETROMINO_MATRIX = {
  o: [
    [0, 1, 1, 0],
    [0, 1, 1, 0],
    [0, 0, 0, 0],
    [0, 0, 0, 0],
  ],
  i: [
    [0, 0, 0, 0],
    [1, 1, 1, 1],
    [0, 0, 0, 0],
    [0, 0, 0, 0],
  ],
  s: [
    [0, 1, 1],
    [1, 1, 0],
    [0, 0, 0],
  ],
  z: [
    [1, 1, 0],
    [0, 1, 1],
    [0, 0, 0],
  ],
  j: [
    [1, 0, 0],
    [1, 1, 1],
    [0, 0, 0],
  ],
  l: [
    [0, 0, 1],
    [1, 1, 1],
    [0, 0, 0],
  ],
  t: [
    [0, 1, 0],
    [1, 1, 1],
    [0, 0, 0],
  ],
};
